# Project Title: Predict Survival of Tragic Voyage - Titanic

## Introduction

Some 100 years ago, a massive ship sank after it collided with an iceberg on the North Atlantic Ocean. About 2200 people were aboard the ship, sadly 1500 people perished in the ocean for its maiden voyage. Royal Mail Ship Titanic was the name given to this British luxury passenger liner. The ship which was known as iconic and unsinkable was the largest liner during that era, was constructed in Belfast, Ireland.

What contributed to the loss of so many lives? Reports cited the ship was travelling too fast, the iceberg warning was dismissed, a fatal wrong turn was made and there were not enough lifeboats. Could the tragedy have been prevented? If the lifeboat drill was not cancelled, more would survive. 

**Which variables contribute to higher survival rate?** That lead us into the focus of this topic, to predict the survival of Titanic.

## Project Goal

1. To explore and analyse who were the passengers onboard Titanic.
2. To predict the passenger survival using machine learning models.
3. Evaluate the best model which is suited for this project.

**ATTENTION**
In order to mount google drive, you need add shortcut to dataset/input into your drive first. Follow this instruction:
1. Go to *'Shared with me'>'Data Analytics'>'The Titanic'>datasets* 
2. Right click and pick 'Add shortcut to Drive'
3. Then just put in in 'My Drive'

In [20]:
#import library
import pandas as pd
from google.colab import drive

drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [0]:
#import dataset
path = "/content/gdrive/My Drive/input"
train = pd.read_csv(path+"/train.csv")
test = pd.read_csv(path+"/test.csv")

## Understanding Data

Show the Dataset
Structure, variables, size of dataset, etc.

First a broad overview. What are the types of data and their typical shape and content?

In [26]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Together with the PassengerId which is just a running index and the indication whether this passenger survived (1) or not (0) we have the following information for each person:

- *Pclass* is the Ticket-class: first (1), second (2), and third (3) class tickets were used. This is an ordinal integer feature. 

- *Name* is the name of the passenger. The names also contain titles and some persons might share the same surname; indicating family relations. We know that some titles can indicate a certain age group. For instance *Master* is a boy while *Mr* is a man. This feature is a character string of variable length but similar format.

- *Sex* is an indicator whether the passenger was female or male. This is a categorical text string feature. 

- *Age* is the integer age of the passenger. There are NaN values in this column.

- *SibSp* is another ordinal integer feature describing the number of siblings or spouses travelling with each passenger.

- *Parch* is another ordinal integer features that gives the number of parents or children travelling with each passenger.

- *Ticket* is a character string of variable length that gives the ticket number.

- *Fare* is a float feature showing how much each passenger paid for their rather memorable journey.

- *Cabin* gives the cabin number of each passenger. There are NaN in this column. This is another string feature.

- *Embarked* shows the port of embarkation as a categorical character value.

In summary we have 1 floating point feature (*Fare*), 1 integer variable (*Age*), 3 ordinal integer features (*Plcass, SibSp, Parch*), 2 categorical text features (*Sex, Embarked*), and 3 text string features (*Ticket, Cabin, Name*).

In [27]:
train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

The minimum/maxim values for pclass, age, sibsp, parch show us the range of these features. Also we see that there's quite a range in fares.